leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_1_OFF (9u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_2_OFF (17u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.I1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_I1SEL_3_OFF (25u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_0_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_0_OFF (4u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_1_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_1_OFF (12u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_2_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_2_OFF (20u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_3_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1F_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1F_3_OFF (28u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_0 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_0_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_1 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_1_OFF (8u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_2 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_2_OFF (16u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.O1SEL_3 */
#define IFX_GTM_DTM_CH_CTRL1_O1SEL_3_OFF (24u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_1 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_1_OFF (10u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_2 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_2_OFF (18u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SH_EN_3 */
#define IFX_GTM_DTM_CH_CTRL1_SH_EN_3_OFF (26u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_0 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_0_OFF (3u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_1 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_1_OFF (11u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_2 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_2_OFF (19u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL1_Bits.SWAP_3 */
#define IFX_GTM_DTM_CH_CTRL1_SWAP_3_OFF (27u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_0_OFF (3u)

