leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_1_OFF (11u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_2_OFF (19u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT0_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT0_3_OFF (27u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_0 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_0_OFF (7u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_1 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_1_OFF (15u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_2 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_2_OFF (23u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.DT1_3 */
#define IFX_GTM_DTM_CH_CTRL2_DT1_3_OFF (31u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_0_OFF (1u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_1_OFF (9u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_2_OFF (17u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC0_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC0_3_OFF (25u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_0 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_0_OFF (5u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_1 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_1_OFF (13u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_2 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_2_OFF (21u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.OC1_3 */
#define IFX_GTM_DTM_CH_CTRL2_OC1_3_OFF (29u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_0_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_1_OFF (8u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_2_OFF (16u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL0_3_OFF (24u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_0_OFF (4u)

