leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_1_OFF (12u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_2_OFF (20u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.POL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_POL1_3_OFF (28u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_0_OFF (2u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_1_OFF (10u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_2_OFF (18u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL0_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL0_3_OFF (26u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_0_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_0 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_0_OFF (6u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_1_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_1 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_1_OFF (14u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_2 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_2_OFF (22u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_Bits.SL1_3 */
#define IFX_GTM_DTM_CH_CTRL2_SL1_3_OFF (30u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_0_SR_OFF (3u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_1_SR_OFF (11u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_2_SR_OFF (19u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT0_3_SR_OFF (27u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_0_SR_OFF (7u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_1_SR_OFF (15u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_2_SR_OFF (23u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.DT1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_DT1_3_SR_OFF (31u)

