leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_0_SR_OFF (1u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_1_SR_OFF (9u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_2_SR_OFF (17u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC0_3_SR_OFF (25u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_0_SR_OFF (5u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_1_SR_OFF (13u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_2_SR_OFF (21u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.OC1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_OC1_3_SR_OFF (29u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_0_SR_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_1_SR_OFF (8u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_2_SR_OFF (16u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL0_3_SR_OFF (24u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_0_SR_OFF (4u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_1_SR_OFF (12u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_2_SR_OFF (20u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.POL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_POL1_3_SR_OFF (28u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_0_SR_OFF (2u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_1_SR_LEN (1u)

