leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_1_SR_OFF (10u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_2_SR_OFF (18u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL0_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL0_3_SR_OFF (26u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_0_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_0_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_0_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_0_SR_OFF (6u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_1_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_1_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_1_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_1_SR_OFF (14u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_2_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_2_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_2_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_2_SR_OFF (22u)

/** \brief  Length for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_3_SR_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_3_SR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_CH_CTRL2_SR_Bits.SL1_3_SR */
#define IFX_GTM_DTM_CH_CTRL2_SR_SL1_3_SR_OFF (30u)

/** \brief  Length for Ifx_GTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_DTM_CTRL_CLK_SEL_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_DTM_CTRL_CLK_SEL_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_CTRL_Bits.CLK_SEL */
#define IFX_GTM_DTM_CTRL_CLK_SEL_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_DTM_CTRL_UPD_MODE_LEN (3u)

/** \brief  Mask for Ifx_GTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_DTM_CTRL_UPD_MODE_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_DTM_CTRL_Bits.UPD_MODE */
#define IFX_GTM_DTM_CTRL_UPD_MODE_OFF (4u)

/** \brief  Length for Ifx_GTM_DTM_DTV_CH_Bits.RELFALL */
#define IFX_GTM_DTM_DTV_CH_RELFALL_LEN (10u)

/** \brief  Mask for Ifx_GTM_DTM_DTV_CH_Bits.RELFALL */
#define IFX_GTM_DTM_DTV_CH_RELFALL_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DTM_DTV_CH_Bits.RELFALL */
#define IFX_GTM_DTM_DTV_CH_RELFALL_OFF (16u)

/** \brief  Length for Ifx_GTM_DTM_DTV_CH_Bits.RELRISE */
#define IFX_GTM_DTM_DTV_CH_RELRISE_LEN (10u)

/** \brief  Mask for Ifx_GTM_DTM_DTV_CH_Bits.RELRISE */
#define IFX_GTM_DTM_DTV_CH_RELRISE_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DTM_DTV_CH_Bits.RELRISE */
#define IFX_GTM_DTM_DTV_CH_RELRISE_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_DTM_PS_CTRL_IN_POL_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_DTM_PS_CTRL_IN_POL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_PS_CTRL_Bits.IN_POL */
#define IFX_GTM_DTM_PS_CTRL_IN_POL_OFF (17u)

/** \brief  Length for Ifx_GTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_DTM_PS_CTRL_PSU_IN_SEL_LEN (1u)

/** \brief  Mask for Ifx_GTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_DTM_PS_CTRL_PSU_IN_SEL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DTM_PS_CTRL_Bits.PSU_IN_SEL */
#define IFX_GTM_DTM_PS_CTRL_PSU_IN_SEL_OFF (16u)

/** \brief  Length for Ifx_GTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_DTM_PS_CTRL_RELBLK_LEN (10u)

/** \brief  Mask for Ifx_GTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_DTM_PS_CTRL_RELBLK_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DTM_PS_CTRL_Bits.RELBLK */
#define IFX_GTM_DTM_PS_CTRL_RELBLK_OFF (0u)

/** \brief  Length for Ifx_GTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_DTM_PS_CTRL_SHIFT_SEL_LEN (2u)

/** \brief  Mask for Ifx_GTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_DTM_PS_CTRL_SHIFT_SEL_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_DTM_PS_CTRL_Bits.SHIFT_SEL */
#define IFX_GTM_DTM_PS_CTRL_SHIFT_SEL_OFF (20u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_IM_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_IM_ADDR_EIRQ_EN_OFF (2u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_TO_XPT_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_TO_XPT_EIRQ_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_ADDR_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_ADDR_EIRQ_EN_OFF (1u)

/** \brief  Length for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_MSK (0x1u)

