leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_EIRQ_EN_Bits.AEI_USP_BE_EIRQ_EN */
#define IFX_GTM_EIRQ_EN_AEI_USP_BE_EIRQ_EN_OFF (3u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.AEI_IN */
#define IFX_GTM_HW_CONF_AEI_IN_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.AEI_IN */
#define IFX_GTM_HW_CONF_AEI_IN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.AEI_IN */
#define IFX_GTM_HW_CONF_AEI_IN_OFF (2u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_HW_CONF_BRIDGE_MODE_RST_OFF (1u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_HW_CONF_GRSTEN_OFF (0u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_HW_CONF_IRQ_MODE_LEVEL_OFF (16u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_MSK (0x1u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_OFF (18u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_PULSE_OFF (17u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.IRQ_MODE_SINGLE_PULSE */
#define IFX_GTM_HW_CONF_IRQ_MODE_SINGLE_PULSE_OFF (19u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_HW_CONF_TOM_OUT_RST_OFF (8u)

/** \brief  Length for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_LEN (3u)

/** \brief  Mask for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_HW_CONF_TOM_TRIG_CHAIN_OFF (9u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_0_AEI_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_OFF (10u)

