leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_OFF (11u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_OFF (12u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_OFF (13u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH14_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH14_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH14_IRQ_OFF (14u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH15_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH15_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH15_IRQ_OFF (15u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH8_IRQ_OFF (8u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH9_IRQ_OFF (9u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH0_IRQ_OFF (16u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH10_IRQ_OFF (26u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH11_IRQ_OFF (27u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH12_IRQ_OFF (28u)

