leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH13_IRQ_OFF (29u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH14_IRQ_OFF (30u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH15_IRQ_OFF (31u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH1_IRQ_OFF (17u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH2_IRQ_OFF (18u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH3_IRQ_OFF (19u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH4_IRQ_OFF (20u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH5_IRQ_OFF (21u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH6_IRQ_OFF (22u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH7_IRQ_OFF (23u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH8_IRQ_OFF (24u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM1_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM1_CH9_IRQ_OFF (25u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH0_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH0_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH0_EIRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH1_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH1_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH1_EIRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH2_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH2_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH2_EIRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH3_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH3_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH3_EIRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH4_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH4_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH4_EIRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH5_EIRQ_LEN (1u)

