leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH5_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH5_EIRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH6_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH6_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH6_EIRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH7_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH7_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_CEI1_Bits.TIM0_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI1_TIM0_CH7_EIRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.GTM_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_GTM_EIRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM0_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM0_EIRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL10_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL10_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL10 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL10_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL11_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL11_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL11 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL11_OFF (22u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL12_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL12_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL12 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL12_OFF (24u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL13 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL13_OFF (26u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL14 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL14_OFF (28u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL15 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL15_OFF (30u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL1_OFF (2u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL2_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_MSK (0x3u)

