leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL3_OFF (6u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL4_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL5_OFF (10u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL6_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL7_OFF (14u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL8 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL8_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_LEN (2u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_INOUTSEL_T_OUTSEL_Bits.SEL9 */
#define IFX_GTM_INOUTSEL_T_OUTSEL_SEL9_OFF (18u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH0SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH0SEL_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH1SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH1SEL_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH2SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH2SEL_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH3SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH3SEL_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH4SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH4SEL_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH5SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH5SEL_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH6SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH6SEL_OFF (24u)

/** \brief  Length for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_TIM_INSEL_Bits.CH7SEL */
#define IFX_GTM_INOUTSEL_TIM_INSEL_CH7SEL_OFF (28u)

/** \brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_IM_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_IM_ADDR_IRQ_EN_OFF (2u)

/** \brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_TO_XPT_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_TO_XPT_IRQ_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_ADDR_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_ADDR_IRQ_EN_OFF (1u)

/** \brief  Length for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_EN_Bits.AEI_USP_BE_IRQ_EN */
#define IFX_GTM_IRQ_EN_AEI_USP_BE_IRQ_EN_OFF (3u)

/** \brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_MSK (0x1u)

