leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_IM_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_IM_ADDR_OFF (2u)

/** \brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_TO_XPT */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_TO_XPT_OFF (0u)

/** \brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_ADDR */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_ADDR_OFF (1u)

/** \brief  Length for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_FORCINT_Bits.TRG_AEI_USP_BE */
#define IFX_GTM_IRQ_FORCINT_TRG_AEI_USP_BE_OFF (3u)

/** \brief  Length for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_LEN (2u)

/** \brief  Mask for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_IRQ_MODE_Bits.IRQ_MODE */
#define IFX_GTM_IRQ_MODE_IRQ_MODE_OFF (0u)

/** \brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_IM_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_IM_ADDR_OFF (2u)

/** \brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_TO_XPT */
#define IFX_GTM_IRQ_NOTIFY_AEI_TO_XPT_OFF (0u)

/** \brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_ADDR */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_ADDR_OFF (1u)

/** \brief  Length for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_LEN (1u)

/** \brief  Mask for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_IRQ_NOTIFY_Bits.AEI_USP_BE */
#define IFX_GTM_IRQ_NOTIFY_AEI_USP_BE_OFF (3u)

/** \brief  Length for Ifx_GTM_KRST0_Bits.RST */
#define IFX_GTM_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_KRST0_Bits.RST */
#define IFX_GTM_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_KRST0_Bits.RST */
#define IFX_GTM_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_GTM_KRST0_Bits.RSTSTAT */
#define IFX_GTM_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_GTM_KRST0_Bits.RSTSTAT */
#define IFX_GTM_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_KRST0_Bits.RSTSTAT */
#define IFX_GTM_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_GTM_KRST1_Bits.RST */
#define IFX_GTM_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_KRST1_Bits.RST */
#define IFX_GTM_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_KRST1_Bits.RST */
#define IFX_GTM_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_GTM_KRSTCLR_Bits.CLR */
#define IFX_GTM_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_GTM_KRSTCLR_Bits.CLR */
#define IFX_GTM_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_KRSTCLR_Bits.CLR */
#define IFX_GTM_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OCS_Bits.SUS */
#define IFX_GTM_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_OCS_Bits.SUS_P */
#define IFX_GTM_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_OCS_Bits.SUSSTA */
#define IFX_GTM_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_LEN (1u)

/** \brief  Mask for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ODA_Bits.DDREN */
#define IFX_GTM_ODA_DDREN_OFF (0u)

/** \brief  Length for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_LEN (1u)

/** \brief  Mask for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ODA_Bits.DREN */
#define IFX_GTM_ODA_DREN_OFF (1u)

/** \brief  Length for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_LEN (2u)

/** \brief  Mask for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_OTBU0T_Bits.CM */
#define IFX_GTM_OTBU0T_CM_OFF (28u)

/** \brief  Length for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_LEN (27u)

/** \brief  Mask for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_GTM_OTBU0T_Bits.CV */
#define IFX_GTM_OTBU0T_CV_OFF (0u)

/** \brief  Length for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_LEN (24u)

/** \brief  Mask for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_OTBU1T_Bits.CV */
#define IFX_GTM_OTBU1T_CV_OFF (0u)

/** \brief  Length for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_LEN (1u)

