leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_OTBU1T_Bits.EN */
#define IFX_GTM_OTBU1T_EN_OFF (28u)

/** \brief  Length for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_LEN (24u)

/** \brief  Mask for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_OTBU2T_Bits.CV */
#define IFX_GTM_OTBU2T_CV_OFF (0u)

/** \brief  Length for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_OTBU2T_Bits.EN */
#define IFX_GTM_OTBU2T_EN_OFF (28u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B0HMI */
#define IFX_GTM_OTSC0_B0HMI_OFF (12u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_LEN (3u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B0HMT */
#define IFX_GTM_OTSC0_B0HMT_OFF (8u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B0LMI */
#define IFX_GTM_OTSC0_B0LMI_OFF (4u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_LEN (3u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B0LMT */
#define IFX_GTM_OTSC0_B0LMT_OFF (0u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B1HMI */
#define IFX_GTM_OTSC0_B1HMI_OFF (28u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_LEN (3u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B1HMT */
#define IFX_GTM_OTSC0_B1HMT_OFF (24u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_OFF (20u)

/** \brief  Length for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_LEN (3u)

/** \brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_OFF (16u)

/** \brief  Length for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_OFF (0u)

/** \brief  Length for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_OFF (8u)

/** \brief  Length for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_LEN (4u)

/** \brief  Mask for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_OFF (16u)

/** \brief  Length for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_OFF (20u)

/** \brief  Length for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_OFF (24u)

/** \brief  Length for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_OFF (28u)

/** \brief  Length for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_OFF (16u)

/** \brief  Length for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_OFF (12u)

/** \brief  Length for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_LEN (4u)

/** \brief  Mask for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_OFF (8u)

/** \brief  Length for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_LEN (8u)

/** \brief  Mask for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_MSK (0xffu)

/** \brief  Offset for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_OFF (0u)

/** \brief  Length for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_LEN (27u)

/** \brief  Mask for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_MSK (0x7ffffffu)

/** \brief  Offset for Ifx_GTM_TBU_CH0_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH0_BASE_BASE_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH0_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief  Length for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_LEN (1u)

/** \brief  Mask for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TBU_CH0_CTRL_Bits.LOW_RES */
#define IFX_GTM_TBU_CH0_CTRL_LOW_RES_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_LEN (24u)

/** \brief  Mask for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_TBU_CH1_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH1_BASE_BASE_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH1_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief  Length for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TBU_CH1_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH1_CTRL_CH_MODE_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_LEN (24u)

/** \brief  Mask for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_MSK (0xffffffu)

