leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_TBU_CH2_BASE_Bits.BASE */
#define IFX_GTM_TBU_CH2_BASE_BASE_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_LEN (3u)

/** \brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_CLK_SRC */
#define IFX_GTM_TBU_CH2_CTRL_CH_CLK_SRC_OFF (1u)

/** \brief  Length for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TBU_CH2_CTRL_Bits.CH_MODE */
#define IFX_GTM_TBU_CH2_CTRL_CH_MODE_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH0 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH0_OFF (0u)

/** \brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH1 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH1_OFF (2u)

/** \brief  Length for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TBU_CHEN_Bits.ENDIS_CH2 */
#define IFX_GTM_TBU_CHEN_ENDIS_CH2_OFF (4u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH0 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH0_OFF (0u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH1 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH1_OFF (1u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH2 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH2_OFF (2u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH3 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH3_OFF (3u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH4 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH4_OFF (4u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH5 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH5_OFF (5u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH6 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH6_OFF (6u)

/** \brief  Length for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_AUX_IN_SRC_Bits.SRC_CH7 */
#define IFX_GTM_TIM_AUX_IN_SRC_SRC_CH7_OFF (7u)

/** \brief  Length for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_LEN (24u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_TIM_CH_CNT_Bits.CNT */
#define IFX_GTM_TIM_CH_CNT_CNT_OFF (0u)

/** \brief  Length for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_LEN (24u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_TIM_CH_CNTS_Bits.CNTS */
#define IFX_GTM_TIM_CH_CNTS_CNTS_OFF (0u)

/** \brief  Length for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_LEN (8u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_MSK (0xffu)

/** \brief  Offset for Ifx_GTM_TIM_CH_CNTS_Bits.ECNT */
#define IFX_GTM_TIM_CH_CNTS_ECNT_OFF (24u)

/** \brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CICTRL */
#define IFX_GTM_TIM_CH_CTRL_CICTRL_OFF (6u)

/** \brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_LEN (3u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_MSK (0x7u)

/** \brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CLK_SEL */
#define IFX_GTM_TIM_CH_CTRL_CLK_SEL_OFF (24u)

/** \brief  Length for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_LEN (1u)

/** \brief  Mask for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TIM_CH_CTRL_Bits.CNTS_SEL */
#define IFX_GTM_TIM_CH_CTRL_CNTS_SEL_OFF (12u)

