leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_LEN (1u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TB_TRIG */
#define IFX_GTM_TOM_TGC1_ACT_TB_TB_TRIG_OFF (24u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ACT_TB_Bits.TBU_SEL */
#define IFX_GTM_TOM_TGC1_ACT_TB_TBU_SEL_OFF (25u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL0 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL1 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL2 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL3 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL4 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL5 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL6 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC1_ENDIS_CTRL_ENDIS_CTRL7_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT6_MSK (0x3u)

