leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC1_ENDIS_STAT_ENDIS_STAT7_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.FUPD_CTRL7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_FUPD_CTRL7_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH0 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH0_OFF (16u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH1 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH1_OFF (18u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH2 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH2_OFF (20u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH3 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH3_OFF (22u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH4 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH4_OFF (24u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH5 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH5_OFF (26u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH6 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH6_OFF (28u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_FUPD_CTRL_Bits.RSTCN0_CH7 */
#define IFX_GTM_TOM_TGC1_FUPD_CTRL_RSTCN0_CH7_OFF (30u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_GLB_CTRL_Bits.HOST_TRIG */
#define IFX_GTM_TOM_TGC1_GLB_CTRL_HOST_TRIG_LEN (1u)

