leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG0 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG1 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG2 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG3 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG4 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG5 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG6 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_INT_TRIG_Bits.INT_TRIG7 */
#define IFX_GTM_TOM_TGC1_INT_TRIG_INT_TRIG7_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC1_OUTEN_CTRL_OUTEN_CTRL7_OFF (14u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT0_OFF (0u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_MSK (0x3u)

