leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT1_OFF (2u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT2_OFF (4u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT3_OFF (6u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT4_OFF (8u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT5_OFF (10u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT6_OFF (12u)

/** \brief  Length for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_LEN (2u)

/** \brief  Mask for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_MSK (0x3u)

/** \brief  Offset for Ifx_GTM_TOM_TGC1_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC1_OUTEN_STAT_OUTEN_STAT7_OFF (14u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_BF_H */
